app/controllers/answers_controller.rb

INSERT INTO "answers" ("response", "question_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["response", "aaaaaaaaa"], ["question_id", 1], ["user_id", 1], ["created_at", 2017-02-22 10:59:07 UTC], ["updated_at", 2017-02-22 10:59:07 UTC]]
---
  def create
    @answer = Answer.new(answer_params)

    if @answer.save

UPDATE "answers" SET "response" = $1, "updated_at" = $2 WHERE "answers"."id" = $3  [["response", "aaaarrrrr"], ["updated_at", 2017-02-22 11:15:43 UTC], ["id", 5]]
---
  def update
    if @answer.update(answer_params)