app/controllers/questions_controller.rb

  def create
    @question = Question.new(question_params)

    if @question.save
---
INSERT INTO "questions" ("question_type", "question_text", "survey_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["question_type", "integer"], ["question_text", "On a scale???"], ["survey_id", 25], ["created_at", 2017-02-21 12:56:31 UTC], ["updated_at", 2017-02-21 12:56:31 UTC]]

  def update
    if @question.update(question_params)
---
UPDATE "questions" SET "question_text" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["question_text", "Do you think this is working?"], ["updated_at", 2017-02-19 22:20:55 UTC], ["id", 3]]