app/controllers/surveys_controller.rb

INSERT INTO "surveys" ("title", "user_id", "started", "finished", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "This is another survey"], ["user_id", 1], ["started", Wed, 22 Feb 2017], ["finished", Fri, 24 Feb 2017], ["created_at", 2017-02-21 12:26:36 UTC], ["updated_at", 2017-02-21 12:26:36 UTC]]
---
  def create
    @survey = Survey.new(survey_params)

    if @survey.save

UPDATE "surveys" SET "title" = $1, "code" = $2, "started" = $3, "finished" = $4, "updated_at" = $5 WHERE "surveys"."id" = $6  [["title", "This is Chris's first new survey"], ["code", "eadgbe"], ["started", Thu, 16 Feb 2017], ["finished", Sat, 25 Feb 2017], ["updated_at", 2017-02-19 20:52:31 UTC], ["id", 1]]
---
  def update
    if @survey.update(survey_params)

DELETE FROM "surveys" WHERE "surveys"."id" = $1  [["id", 7]]
---
  def destroy
    @survey.destroy

SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def set_survey
      @survey = Survey.find(params[:id])